config.org
#+title: Literate Doom Emacs Configuration
#+options: toc:nil
#+startup: overview
#+begin_src emacs-lisp
;; -*- lexical-binding: t -*-
#+end_src

* General
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Linus Sehn"
      user-mail-address "linus@sehn.tech"
      projectile-project-search-path '("~/Projects" "/home/lino")
      bookmark-default-file "~/.doom.d/bookmarks")
#+end_src
* UI
** Fonts
#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "Iosevka" :size 16)
      doom-variable-pitch-font (font-spec :family "Roboto")
      doom-unicode-font (font-spec :family "all-the-icons")
      doom-big-font (font-spec :family "Iosevka" :size 19))
#+end_src
** Theme & Modeline
#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-one
      doom-themes-enable-bold t
      dired-dwim-target t
      display-time-24hr-format t
      display-time-default-load-average nil)

(display-time-mode 1)
#+end_src
** Focus Mode
#+begin_src emacs-lisp :tangle yes
(after! writeroom-mode
  (setq writeroom-fullscreen-effect t))
#+end_src
** Popups
#+begin_src emacs-lisp :tangle yes
(set-popup-rules!
 '(("^\*helm"
    :size 0.45 :select t :modeline t :quit t :ttl t)))
#+end_src
** Auto-fill-mode
#+begin_src emacs-lisp :tangle yes
(add-hook! 'text-mode-hook auto-fill-mode)
#+end_src
** Toggle Fullscreen on Start-up
#+begin_src emacs-lisp :tangle yes
(toggle-frame-fullscreen)
#+end_src
* Dictionaries & Grammar
** Default Dictionary
#+begin_src emacs-lisp :tangle yes
(setq ispell-dictionary "en_GB")
#+end_src
** Save word to Dictionary
#+begin_src emacs-lisp :tangle yes
(defun my/save-to-dict ()
  (interactive)
  (let ((current-location (point))
        (word (flyspell-get-word)))
    (when (consp word)
      (flyspell-do-correct 'save nil (car word) current-location (cadr word) (caddr word) current-location))))
#+end_src
** Grammar
This requires langtool (which requires =Java 1.8+=). You can acquire it from
https://languagetool.org/.

#+begin_src emacs-lisp :tangle yes
(setq langtool-language-tool-jar "~/.langtool")
#+end_src
** Bindings
#+begin_src emacs-lisp :tangle yes
(defun my/save-to-dict ()
  (interactive)
  (let ((current-location (point))
        (word (flyspell-get-word)))
    (when (consp word)
      (flyspell-do-correct 'save nil (car word) current-location (cadr word) (caddr word) current-location))))

(defun my/switch-to-de-dict ()
  (interactive)
  (ispell-change-dictionary "de_DE")
  (flyspell-buffer))

(defun my/switch-to-en-dict ()
  (interactive)
  (ispell-change-dictionary "en_GB")
  (flyspell-buffer))

(map! :leader
      (:prefix-map ("d" . "dict")
        :desc "Add to dictionary"      "a"     #'my/save-to-dict
        :desc "Change to german"       "g"     #'my/switch-to-de-dict
        :desc "Change to english"      "e"     #'my/switch-to-en-dict))
#+end_src
* E-mail
** General
#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setq mu4e-root-maildir "~/.mail/")
  (set-email-account! "sehn.tech"
                      '((mu4e-sent-folder       . "/mailbox/Sent")
                        (mu4e-drafts-folder     . "/mailbox/Drafts")
                        (mu4e-trash-folder      . "/mailbox/Trash")
                        (mu4e-refile-folder     . "/mailbox/Archive/2020")
                        (mu4e-compose-signature . "---\nLinus Sehn\nGraduate Student | International Relations and Computer Science\nFU Berlin, HU Berlin, Uni Potsdam\nlinus@sehn.tech | https://sehn.tech")
                        (smtpmail-smtp-user     . "linus@sehn.tech")
                        (user-mail-address      . "linus@sehn.tech")
                        (user-full-name         . "Linus Sehn"))
                      t)

  (setq mu4e-compose-complete-addresses 't
        mu4e-use-fancy-chars 'nil
        mu4e-sent-messages-behavior 'sent
        mu4e-update-interval 300
        smtpmail-debug-info 't
        smtpmail-smtp-user "linus@sehn.tech"
        smtpmail-smtp-server "smtp.mailbox.org"
        smtpmail-default-smtp-server "smtp.mailbox.org"
        smtpmail-stream-type 'ssl
        smtpmail-smtp-service 465))

#+end_src

Don't set =-T= flag for normal delete operation
#+begin_src emacs-lisp :tangle yes
(after! mu4e
  (setf (alist-get 'trash mu4e-marks)
        (list :char '("d" . "▼")
              :prompt "dtrash"
              :dyn-target (lambda (target msg)
                          (mu4e-get-trash-folder msg))
              :action (lambda (docid msg target)
                        ;; Here's the main difference to the regular trash mark,
                        ;; no +T before -N so the message is not marked as
                        ;; IMAP-deleted:
                        (mu4e~proc-move docid (mu4e~mark-check-target target) "-N")))))
#+end_src
** Composer
#+begin_src emacs-lisp :tangle yes
(use-package! org-mu4e
  :after mu4e
  :config
  (setq org-mu4e-convert-to-html t
        mu4e-compose-mode-hook nil)

  ;; Only render to html once. If the first send fails for whatever reason,
  ;; org-mu4e would do so each time you try again.
  (add-hook! 'message-send-hook
    (setq-local org-mu4e-convert-to-html nil)))
#+end_src
** Alerts
#+begin_src emacs-lisp :tangle no
(use-package! mu4e-alert
  :after mu4e
  :hook (after-init . mu4e-alert-enable-mode-line-display)
  :config (mu4e-alert-set-default-style 'libnotify))

(setq doom-modeline-mu4e t)
(mu4e-alert-enable-mode-line-display)
#+end_src
** Bindings
#+begin_src emacs-lisp :tangle yes
(map! :leader
      (:desc "e-mail" "e" #'mu4e))
#+end_src
* Org-mode
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/org")
#+end_src
** Keywords
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "PROJ(p)" "|" "DONE(d)")
          (sequence "[ ](T)" "[-](P)" "[?](M)" "|" "[X](D)")
          (sequence "NEXT(n)" "WAIT(w)" "HOLD(h)" "|" "ABRT(c)")
          (sequence "TOREAD(r)" "|" "READ(R)"))))
#+end_src
** Download
#+begin_src emacs-lisp :tangle yes
(use-package! org-download
  :after org
  :config
  (setq-default org-download-method 'directory
                org-download-image-dir "./images"
                org-download-heading-lvl nil))
#+end_src

#+RESULTS:
: t

** Capture Templates
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-capture-templates
      '(("t" "TODO" entry
        (file+headline "~/org/actions.org" "Other")
        "* TODO [#A] %?\n%a\n")
        ("a" "APPOINTMENT" entry
        (file+headline "~/org/calendar.org" "Appointments")
        "* %?\n%(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n%a\n")
        ("d" "DISTRACTION" entry
        (file "~/org/distractions.org")
        "* %?\n%T\n** What was I doing\n** What was the trigger?"))
      ))
#+end_src
** Clocking
#+begin_src emacs-lisp :tangle yes
(setq org-clock-mode-line-total 'today)
#+end_src
** Clock Budget
#+begin_src emacs-lisp :tangle yes
(use-package! org-clock-budget
  :after org
  :config
  ;; set colors for different budget exhaustion states
  (setq org-clock-budget-ratio-faces '((1.0 hydra-face-red)
                                       (0.95 font-lock-type-face)
                                       (0.5 ivy-confirm-face)
                                       (0.0 font-lock-keyword-face))
  ;; set time-format to h:mm
        org-duration-format (quote h:mm))
  ;; make popup-buffer larger
  (set-popup-rule! "^\\*Org clock budget report" :size 0.35 :quit nil))

;; some custom functions for displaying
(defun show-yearly-clock-budget ()
  "Show yearly org-clock budget"
  (interactive)
  (setq org-clock-budget-intervals '(("BUDGET_YEAR" org-clock-budget-interval-this-year)))
  (org-clock-budget-report)
  )

(defun show-monthly-clock-budget ()
  "Show monthly org-clock budget"
  (interactive)
  (setq org-clock-budget-intervals '(("BUDGET_MONTH" org-clock-budget-interval-this-month)))
  (org-clock-budget-report)
  )

(defun show-weekly-clock-budget ()
  "Show yearly org-clock budget"
  (interactive)
  (setq org-clock-budget-intervals '(("BUDGET_WEEK" org-clock-budget-interval-this-week)))
  (org-clock-budget-report)
  )

(map! :map org-mode-map
     (:localleader
       :desc "Show weekly budget"     "w"     #'show-weekly-clock-budget
       ))
#+end_src
