config.org
**** Export Backlinks
#+begin_src emacs-lisp :tangle yes
(after! (org org-roam)
    (defun my/org-roam--backlinks-list (file)
      (if (org-roam--org-roam-file-p file)
          (--reduce-from
           (concat acc (format "- *[[file:%s][%s]]*\n"
                               (file-relative-name (car it) org-roam-directory)
                               (org-roam--get-title-or-slug (car it))))
           "" (org-roam-db-query [:select [from]
                                  :from links
                                  :where (= to $s1)
                                  :and from :not :like $s2] file "%private%"))
        ""))
    (defun my/org-export-preprocessor (_backend)
      (let ((links (my/org-roam--backlinks-list (buffer-file-name))))
        (unless (string= links "")
          (save-excursion
            (goto-char (point-max))
            (insert (concat "\n* Backlinks\n" links))))))
    (add-hook 'org-export-before-processing-hook 'my/org-export-preprocessor))
#+end_src

#+RESULTS:
| my/org-export-preprocessor | org-blackfriday--reset-org-blackfriday--code-block-num-backticks |

#+begin_src emacs-lisp :tangle no
(defun my/org-roam--backlinks-list-with-content (file)
  (with-temp-buffer
    (if-let* ((backlinks (org-roam--get-backlinks file))
              (grouped-backlinks (--group-by (nth 0 it) backlinks)))
        (progn
          ;; no display of the number of backlinks
          ;; (insert (format "\n\n** %d Backlink(s)\n"
          ;;                 (length backlinks)))
          (dolist (group grouped-backlinks)
            (let ((file-from (car group))
                  (bls (cdr group)))
              (insert (format "- *[[file:%s][%s]]*\n\n"
                              file-from
                              (org-roam--get-title-or-slug file-from)))
              (dolist (backlink bls)
                (pcase-let ((`(,file-from _ ,props) backlink))
                  (insert (s-trim (s-replace "\n" " " (plist-get props :content))))
                  (insert "\n\n")))))))
    (buffer-string)))

  (defun my/org-export-preprocessor (backend)
    (let ((links (my/org-roam--backlinks-list-with-content (buffer-file-name))))
      (unless (string= links "")
        (save-excursion
          (goto-char (point-max))
          (insert (concat "\n* Backlinks\n") links)))))

  (add-hook 'org-export-before-processing-hook 'my/org-export-preprocessor)
#+end_src
**** Bibliography
#+begin_src emacs-lisp :tangle yes
(setq! +biblio-pdf-library-dir "~/Library/"
       +biblio-default-bibliography-files
       '("~/org/roam/biblio/library.bib"
         "~/org/roam/biblio/stusti_predpol.bib"
         "~/org/roam/biblio/platform_state_surveillance.bib")
       +biblio-notes-path "~/org/roam/")

#+end_src

#+RESULTS:
: ~/org/roam/

#+begin_src emacs-lisp :tangle yes
(after! org-roam-bibtex
    (setq orb-preformat-keywords
          '("=key=" "title" "url" "file" "author-or-editor" "keywords" "year"))
    (setq orb-templates
          '(("r" "ref" plain (function org-roam-capture--get-point)
             ""
             :file-name "${slug}"
             :head "#+TITLE: Notes on: ${title} (${author-or-editor}, ${year})\n#+HUGO_BASE_DIR:~/Projects/personal-website\n#+ROAM_KEY: ${ref}

Links ::
\n* Summary\n#+begin_src toml :front_matter_extra t
subtitle = \"\"
summary = \"\"
tags = [\"reading note\", \"\"]\n#+end_src
\n* Main points\n:PROPERTIES:\n:Custom_ID: ${=key=}\n:NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n:NOTER_PAGE:\n:END:\n\n"
             :unnarrowed t))))
#+end_src

- company-bibtex
#+begin_src emacs-lisp :tangle yes
(use-package! company-bibtex
  :after org
  :config
  (set-company-backend! 'org-mode 'company-bibtex)
  (setq company-bibtex-bibliography
    '("/home/lino/org/roam/biblio/library.bib"
        "/home/lino/org/roam/biblio/stusti_predpol.bib")
    company-bibtex-org-citation-regex "cite[a-z]+:+"))
#+end_src

#+RESULTS:
: t

- efficient keybinds
#+begin_src emacs-lisp :tangle yes
(map! :map org-mode-map
      ("M-i" #'org-ref-helm-insert-cite-link)
      ("M-e" #'org-ref-update-pre-post-text)
      ("M-p" #'my/org-ref-open-pdf-at-point)
      ("M-n" #'org-roam-insert)
      (:leader
        (:prefix "i"
          :desc "Cite source" "c" #'org-ref-helm-insert-cite-link
          )))
#+end_src

#+RESULTS:
: org-ref-helm-insert-cite-link

- minimalist cite insertino with ivy
#+begin_src emacs-lisp :tangle no
(defun prepost (keys)
  "Formatter for org-ref citations."
  (let* ((prenote  (if bibtex-completion-cite-prompt-for-optional-arguments (read-from-minibuffer "Prenote: ") ""))
         (postnote (if bibtex-completion-cite-prompt-for-optional-arguments (read-from-minibuffer "Postnote: ") "")))
(if (and (string= "" prenote) (string= "" postnote))
                (format "%s" (s-join "; " (--map (concat "autocite:" it) keys)))
    (format "[[%s][%s::%s]]"  (s-join "; " (--map (concat "autocite:" it) keys)) prenote postnote))))

(setq org-ref-bibtex-files '("/home/lino/org/roam/biblio/library.bib"))
(length (orhc-bibtex-candidates))

(defun cite ()
  (interactive)
  (ivy-read "select: " (orhc-bibtex-candidates)
            :action (lambda (entry)
                      (let ((key (cdr (assoc "=key=" entry)))
                            (type (if ivy-current-prefix-arg
                                      (ivy-read "type: " org-ref-cite-types)
                                    "cite")))
                        (with-ivy-window
                          (insert (format "%s:%s" type key)))))))
#+end_src

***** Use helm-bibtex
#+begin_src emacs-lisp :tangle yes
(use-package! org-ref
  :when (featurep! :lang org)
  :after (org bibtex-completion)
  :preface
  (setq org-ref-completion-library #'org-ref-helm-bibtex))
  :config
  ;; Although the name is helm-bibtex, it is actually a bibtex-completion function
  ;; it is the legacy naming of the project helm-bibtex that causes confusion.
  (setq org-ref-open-pdf-function 'org-ref-get-pdf-filename-helm-bibtex)
  ;; org-roam-bibtex will define handlers for note taking so not needed to use the
  ;; ones set for bibtex-completion
  (unless (featurep! :lang org +roam)
    ;; Allow org-ref to use the same template mechanism as {helm,ivy}-bibtex for
    ;; multiple files if the user has chosen to spread their notes.
    (setq org-ref-notes-function (if (directory-name-p org-ref-notes-directory)
                                     #'org-ref-notes-function-many-files
                                   #'org-ref-notes-function-one-file
                                   )))
#+end_src

#+RESULTS:
***** Open pdf at point
#+begin_src emacs-lisp :tangle yes
(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results)))
    (funcall bibtex-completion-pdf-open-function (car (bibtex-completion-find-pdf key)))))
(setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)
#+end_src

#+RESULTS:
: my/org-ref-open-pdf-at-point

***** Adding pre and post notes to ivy-bibtex
#+begin_src emacs-lisp :tangle no
(defun bibtex-completion-format-citation-orgref (keys)
  "Formatter for org-ref citations."
  (let* ((prenote  (if bibtex-completion-cite-prompt-for-optional-arguments (read-from-minibuffer "Prenote: ") ""))
         (postnote (if bibtex-completion-cite-prompt-for-optional-arguments (read-from-minibuffer "Postnote: ") "")))
(if (and (string= "" prenote) (string= "" postnote))
                (format "%s" (s-join "; " (--map (concat "cite:" it) keys)))
    (format "[[%s][%s::%s]]"  (s-join "; " (--map (concat "cite:" it) keys)) prenote postnote))))
#+end_src

#+RESULTS:
: bibtex-completion-format-citation-orgref

***** LaTeX-export
#+begin_src emacs-lisp :tangle yes
(after! org
  (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")
        org-export-with-smart-quotes t))
#+end_src

#+RESULTS:
: t

