config.el

(after! (org org-roam)
    (defun my/org-roam--backlinks-list (file)
      (if (org-roam--org-roam-file-p file)
          (--reduce-from
           (concat acc (format "- *[[file:%s][%s]]*\n"
                               (file-relative-name (car it) org-roam-directory)
                               (org-roam--get-title-or-slug (car it))))
           "" (org-roam-db-query [:select [from]
                                  :from links
                                  :where (= to $s1)
                                  :and from :not :like $s2] file "%private%"))
        ""))
    (defun my/org-export-preprocessor (_backend)
      (let ((links (my/org-roam--backlinks-list (buffer-file-name))))
        (unless (string= links "")
          (save-excursion
            (goto-char (point-max))
            (insert (concat "\n* Backlinks\n" links))))))
    (add-hook 'org-export-before-processing-hook 'my/org-export-preprocessor))

(setq! +biblio-pdf-library-dir "~/Library/"
       +biblio-default-bibliography-files
       '("~/org/roam/biblio/library.bib"
         "~/org/roam/biblio/stusti_predpol.bib"
         "~/org/roam/biblio/platform_state_surveillance.bib")
       +biblio-notes-path "~/org/roam/")

(after! org-roam-bibtex
    (setq orb-preformat-keywords
          '("=key=" "title" "url" "file" "author-or-editor" "keywords" "year"))
    (setq orb-templates
          '(("r" "ref" plain (function org-roam-capture--get-point)
             ""
             :file-name "${slug}"
             :head "#+TITLE: Notes on: ${title} (${author-or-editor}, ${year})\n#+HUGO_BASE_DIR:~/Projects/personal-website\n#+ROAM_KEY: ${ref}

*Links* ::
\n* Summary\n#+begin_src toml :front_matter_extra t
subtitle = \"\"
summary = \"\"
tags = [\"reading note\", \"\"]\n#+end_src
\n* Main points\n:PROPERTIES:\n:Custom_ID: ${=key=}\n:NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n:NOTER_PAGE:\n:END:\n\n"
             :unnarrowed t))))

(use-package! company-bibtex
  :after org
  :config
  (set-company-backend! 'org-mode 'company-bibtex)
  (setq company-bibtex-bibliography
    '("/home/lino/org/roam/biblio/library.bib"
        "/home/lino/org/roam/biblio/stusti_predpol.bib")
    company-bibtex-org-citation-regex "cite:"))

(map! :map org-mode-map
      ("M-i" #'org-ref-helm-insert-cite-link)
      ("M-e" #'org-ref-update-pre-post-text)
      ("M-p" #'my/org-ref-open-pdf-at-point)
      ("M-n" #'org-roam-insert)
      (:leader
        (:prefix "i"
          :desc "Cite source" "c" #'org-ref-helm-insert-cite-link
          )))

(use-package! org-ref
  :when (featurep! :lang org)
  :after (org bibtex-completion)
  :preface
  (setq org-ref-completion-library #'org-ref-helm-bibtex))
  :config
  ;; Although the name is helm-bibtex, it is actually a bibtex-completion function
  ;; it is the legacy naming of the project helm-bibtex that causes confusion.
  (setq org-ref-open-pdf-function 'org-ref-get-pdf-filename-helm-bibtex)
  ;; org-roam-bibtex will define handlers for note taking so not needed to use the
  ;; ones set for bibtex-completion
  (unless (featurep! :lang org +roam)
    ;; Allow org-ref to use the same template mechanism as {helm,ivy}-bibtex for
    ;; multiple files if the user has chosen to spread their notes.
    (setq org-ref-notes-function (if (directory-name-p org-ref-notes-directory)
                                     #'org-ref-notes-function-many-files
                                   #'org-ref-notes-function-one-file
                                   )))

(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results)))
    (funcall bibtex-completion-pdf-open-function (car (bibtex-completion-find-pdf key)))))
(setq org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point)

(after! org
  (setq org-latex-pdf-process (list "latexmk -shell-escape -bibtex -f -pdf %f")))

(after! ox-hugo
