config.org
***** Hugo Export
#+begin_src emacs-lisp :tangle yes
(after! ox-hugo
  (setq org-hugo-default-section-directory "roam"))
#+end_src

make ox-hugo play nice with org-ref
#+begin_src emacs-lisp :tangle yes
(use-package! org-ref-ox-hugo
  :after org org-ref ox-hugo
  :config
  (add-to-list 'org-ref-formatted-citation-formats
               '("md"
                 ("article" . "${author}. (${year}). *${title}*, ${journal}, *${volume}(${number})*, ${pages} ${doi}.")
                 ("inproceedings" . "${author}. *${title}*, In ${editor}, ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                 ("book" . "${author-or-editor}. (${year}). *${title}*.")
                 ("phdthesis" . "${author}. *${title}* (Doctoral dissertation) (${year}). ${school}, ${address}.")
                 ("inbook" . "${author}. *${title}*, In ${editor} (Eds.), ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                 ("incollection" . "${author}. *${title}*, In ${editor} (Eds.), ${booktitle} (pp. ${pages}) (${year}). ${address}: ${publisher}.")
                 ("proceedings" . "${editor} (Eds.), _${booktitle}_ (${year}). ${address}: ${publisher}.")
                 ("unpublished" . "${author}. *${title}* (${year}). Unpublished manuscript.")
                 ("misc" . "${author} (${year}). *${title}*. Retrieved from [${url}](${url}). ${web_note}.")
                 (nil . "${author}. (${year}). *${title}* "))))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle yes
(defun my/org-ref-get-md-bibliography (&optional sort)
  "Create an md bibliography when there are keys.
if SORT is non-nil the bibliography is sorted alphabetically by key."
  (let ((keys (org-ref-get-bibtex-keys sort)))
    (when keys
      (concat
       "\n"
       (mapconcat (lambda (x) (org-ref-get-bibtex-entry-md x)) keys "\n\n")
       "\n"))))

(defun org-ref-bibliography-format (keyword desc format)
  "Formatting function for bibliography links."
  (cond
   ((eq format 'org) (org-ref-get-org-bibliography))
   ((eq format 'ascii) (org-ref-get-ascii-bibliography))
   ((eq format 'md) (my/org-ref-get-md-bibliography))
   ((eq format 'odt) (org-ref-get-odt-bibliography))
   ((eq format 'html) (org-ref-get-html-bibliography))
   ((eq format 'latex)
    ;; write out the latex bibliography command
    (format "\\bibliography{%s}"
	    (replace-regexp-in-string
	     "\\.bib" ""
	     (mapconcat
	      'identity
	      (mapcar 'file-relative-name
		      (split-string keyword ","))
	      ","))))))

#+end_src

#+RESULTS:
: org-ref-bibliography-format

**** Bindings
#+begin_src emacs-lisp :tangle yes
(map! :map org-mode-map
      (:localleader
        (:prefix ("a" . "attachments")
          "c" #'org-download-screenshot
          "y" #'org-download-yank
          )))
#+end_src

#+RESULTS:

*** TODO Deft
**** General
#+begin_src emacs-lisp :tangle yes
(setq deft-directory "~/org/roam"
      deft-recursive t
      deft-recursive-ignore-dir-regexp
        (concat "\\(?:"
                "\\."
                "\\|\\.\\."
                "\\\|.+stversions"
                "\\|code"
                "\\|auto"
                "\\|_minted.*"
                "\\)$"))
#+end_src

#+RESULTS:
: \(?:\.\|\.\.\|.+stversions\|code\|auto\|_minted.*\)$

**** Custom Functions
#+begin_src emacs-lisp :tangle yes
(defun my/kill-buffer-regexp (regexp)
  "Kill buffers matching REGEXP without asking for permission."
  (interactive "sKill buffers matching this regexp: ")
  (cl-letf (((symbol-function 'kill-buffer-ask) #'kill-buffer))
    (kill-matching-buffers regexp)))

(defun my/show-org-notes ()
  (interactive)
  (kill-buffer-regexp "*Deft*")
  (setq-default deft-directory "~/org")
  (deft))

(defun my/show-course-notes ()
  (interactive)
  (kill-buffer-regexp "*Deft*")
  (setq-default deft-directory "~/org/archive/courses")
  (deft))
#+end_src
*** Bindings
* PDF
** Bindings
#+begin_src emacs-lisp :tangle yes
(map! :map pdf-view-mode-map
      "C-c i" 'org-noter-insert-note)
#+end_src

#+RESULTS:

**** Bindings
* Languages
** LaTeX
** Python
